# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import random

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [23]:
series1 = pd.Series([random.randint(1,4) for i in range(0,100)])
series2 = pd.Series([random.randint(1,3) for i in range(0,100)])
series3 = pd.Series([random.randint(10000,30000) for i in range(0,100)])

### Step 3. Let's create a DataFrame by joinning the Series by column

In [24]:
df = pd.concat([series1, series2, series3], axis =  1)
df.head(1)

   0  1      2
0  4  2  16863

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [25]:
mapper = {0: "beds", 1:"baths", 2:"price_sqr_mts"}
df.rename(columns = mapper, inplace = True)
df.head(3)

   beds  baths  price_sqr_mts
0     4      2          16863
1     2      2          23458
2     4      2          27809

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [26]:
bigcolumn = pd.DataFrame(pd.concat([series1, series2, series3], axis =  0))
bigcolumn

        0
0       4
1       2
2       4
3       4
4       2
..    ...
95  17376
96  14321
97  19743
98  27590
99  13479

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [28]:
bigcolumn.index

Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
       ...
       90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
      dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [36]:
new_index = [i for i in range(0, 300)]  # Ensures index goes up to 299
bigcolumn = bigcolumn.reset_index(drop = True)
bigcolumn

         0
0        4
1        2
2        4
3        4
4        2
..     ...
295  17376
296  14321
297  19743
298  27590
299  13479

[300 rows x 1 columns]